welcome = """Приветствуем вас в клубе Рекорд Фитнес! 💪

Мы рады, что вы решили заняться спортом вместе с нами. Здесь вы можете выбрать тренировку, которая подходит для ваших целей

Готовы начать свой путь к здоровью и отличной физической форме? Давайте выберем идеальную тренировку для вас!"""

program_list = """Выберете номер программы нажав на кнопку ниже:

1. Тренировки для подростка 12-14лет от Владимира Мельникова

2. Сила и выносливость ног: комплекс для настоящих бойцов от Сергея Бронникова

3. Тонус и рельеф: путь к идеальному телу от Анастасии Мельниковой

4. Красивые и соблазнительные ягодицы от Анастасии Мельниковой

5. Архитектура спины: создаем идеальные дельты от Любовь Сткляниной

6. Сила и форма: трансформация широчайшей мышцы

7. Бицепс на максимум: раскрой свой потенциал от Рузиля Газизова

8. «Прокачай свои грудные» от тренера Рузиля Газизова
"""

program_1 = """Тренер Владимир Мельников
Тренировка для детей 12-14 лет. 

Приседания
Техника выполнения

Поставьте ноги на ширине плеч, взгляд направьте вверх. Руки можете скрепить в замок перед собой или вытянуть вперёд.
Отведите таз назад и слегка прогнитесь в пояснице.
На вдохе согните ноги до угла 90 градусов в коленях.
На выдохе вернитесь в исходное положение, не разгибая ноги до конца.
Важно, чтобы ваши пятки были плотно прижаты к полу, а дыхание было равномерным.

Отжимания
Техника выполнения

Примите упор лёжа, руки расположите на ширине плеч, ноги выпрямите и поставьте вместе. Корпус и ноги должны образовать одну прямую линию.
На вдохе медленно согните руки так, чтобы грудью вы могли коснуться пола.
На выдохе выпрямите руки и вернитесь в исходное положение.
Если вы хотите сделать упор на грудные мышцы, руки должны стоять широко друг от друга, а локти уходить в стороны во время отжиманий.
Если вам нужно прокачать руки, их нужно ставить у́же, а локти должны уходить назад вдоль тела.
Выполните четыре подхода по 10-12 повторений. Если тяжело делать классические отжимания, можно выполнять упражнение с колен.

Планка
Техника выполнения

Встаньте в упор лёжа, после чего согните руки и встаньте в планку на локтях. Ваши локти должны находиться под плечевыми суставами, чтобы не создавать излишнюю нагрузку на плечи.
Ноги должны быть прямыми и стоять на мысках примерно на ширине плеч.
Не прогибайтесь и не округляйте поясницу, чтобы мышцы получали максимальную нагрузку.
Направьте взгляд вниз, дышите ровно.
Выполните четыре подхода по 40 секунд. В дальнейшем можете увеличить длительность подходов до минуты.

Гиперэкстензия
Техника выполнения

Лягте на живот, ноги и руки вытяните, ладони рук могут лежать одна на другой.
На вдохе слегка прогнитесь в спине и одновременно поднимите руки и ноги вверх.
Слегка задержитесь в верхней точке, чтобы прочувствовать напряжение.
На выдохе опустите руки и ноги на пол.
Взгляд во время выполнения упражнения должен быть направлен в пол. Голову не запрокидывайте."""

program_2 = """Тренер Сергей Бронников «Сила и выносливость ног: комплекс для настоящих бойцов»
Увеличить силовую выносливость ног

ТРЕНИРОВКА 1
1. ТА присед - 3x6-8
2. Тяга с ямы- 2x12 
3. Выпады (короткие) - 3x15
4. Жим ногами (широко) - 4x15 
5. Сгибания ног с резиной- 100 повторений 

ТРЕНИРОВКА 2
1. Становая тяга – 5х5
2. Присед широкий на тумбу-  2x8 
3. Румынская тяга - 3x12 
4. Жим ногами (узко) - 5x10 
5. Сгибания ног в тренажере лёгкий- 100 повторений 

Делаем всё в умеренно темпе, отдых 1,5-2 минуты, между упражнениями 3. Вес подбирается индивидуально
"""

program_3 = """Тренер Анастасия Мельникова «Тонус и  рельеф: путь к идеальному телу»

     1 день:
1. Ягодичный мостик 3/15 
2. Разведение ног в тренажере сидя 3/30 + выпады с гантелями назад попеременно 3/10 ( в супер серии ) 
3. Жим платформы ногами верхней широкой постановкой ног 3/15 ( замедленное движение вниз ) 
4. Мертвая тяга на прямых ногах 3/15
 5. Сведение ног в тренажере сидя 3/20 
6. Пресс - подъем ног 3/20

      2 день: 
1. Грудные - жим в тренажере Хаммер 3/15 
2. Спина - тяга верхнего блока широким хватом за голову 3/15 
3. Спина - тяга горизонтальная блока сидя к поясу 3/15 
4. Спина - Гиперэкстензия 3/20 
5. Плечи - разведение гантелей стоя через стороны 3/15
6. Трицепс - разгибание рук в кроссовере с веревкой 3/20 

       3 день: 
1. Отведение ноги назад в кроссовере на скамье (либо стоя) 3/15 
2. Приседание средней постановкой ног в машине Смита 3/12 
3. Болгарский выпад на одной ноге 3/12 
4. Сгибание ног в тренажере лежа 3/15 
5. Отведение ноги стоя в сторону с утяжелителем 3/15 
6. Пресс - подъем корпуса 3/20
"""

program_4 = """Тренировка на низ Ноги/ягодицы  «Красивые соблазнительные ягодицы»
Разминка (скручивания на скамье + ласточка) 
1. Сгибание сидя 2*15(вес индивидуально) 1*15 (+5 кг) 1*8 (+5кг) 
2. + сразу разведение в тренажере 25-30 раз  4 подхода 
3. Сгибание лёжа 2*15 (вес индивидуально) 2*8 (+5кг) 4. + сразу румынская тяга с гантелью  20 раз по 4 подхода
 5. Жим ногами (вес индивидуально) 15*3 (убираешь вес -10кг и добиваешь последний подход до отказа) 
6. + сразу приставные шаги с фитнес резинкой 50 раз 
7. Махи прямой ногой 20 раз на каждую ногу на коврике + статика + пружинка по 10 сек 2 рабочих подхода 
8. Сразу после ягодичный мост с фитнес резинкой на коврике 30 раз по 2 подхода + статика + пружинка по 10 сек Заминка (дорожка/растяжка)
"""

program_5 = """Тренировка от тренера Любовь Сткляниной
«Архитектура спины: создаем идеальные дельты»
1й круг:
1. обратные разведения на тренажёре "бабочка": руки слегка согнуть в локтях, голова опущена, кисть подвернуть немного внутрь/ 18 повторений;
2. подтягивания в гравитроне: подобрать вес, оптимальный для выполнения 9 чистых повторений, выполнить; увеличить вес, чтобы возможно было сделать только 4 повтора, и доработать их с читтингом.
1й круг выполнить 4 раза суперсетами 
----------
2й круг:
1. протяжка EZ-грифа (изогнутый) к подбородку (лучше с лямками, чтобы выключить кисть); локти выводить выше ушей/ 18 повторений;
2. тяга Т-грифа (тяжелая)/ в стиле отдых-пауза: 7-6-4 повторения;
3. тяга верхнего блока перед собой/ 12 повторений.
2 круг выполнить 3 раза суперсетами
--------
3. Жим штанги из-за головы стоя (8 повторений) в суперсете с жимом гантелей умеренного веса сидя с выведением локтей немного вперед и опорой на спинку скамьи / 3 подхода.
4. Тяга грифа в тренажёре Смита к поясу (тяжелая) с лямками с задержкой снаряда у живота / 4 подхода
5. Тяга верхнего блока за голову, лёгкий вес / 2 подхода по 25 повторений.
"""

program_6 = """Тренировка «Сила и форма: трансформация широчайшей мышцы»
1.	Подтягивания 4*12
2.	Тяга штанги в наклоне 4*12
3.	Тяга верхнего блока узким хватом 4*12
4.	Пулловер с гантелью 4*15
5.	Тяга у поясу сидя в тренажере 4*15
"""

program_7 = """  Тренировка от Рузиля Газизова
 
«Бицепс на максимум: раскрой свой потенциал.»
- Концентрированные подъёмы на бицепс 4*12. 
-Молотки с гантелями 3*15. 
-Подъем штанги на бицепс стоя 4*12. 
-Попеременное (поочередное) сгибание рук с гантелями 3*20.
"""

program_8 = """ Тренировка «Прокачай свои грудные» от тренера Рузиля Газизова

●	Комплекс разминки (с выполнением нескольких подходов жима лежа с пустым грифом).
●	Жим штанги лежа– 4*8-10.
●	Жим гантель на скамье – 4*10.
●	Отжимания на брусьях – 4*10.
"""
